package com.example.neo4j;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileNotFoundException;
import java.io.FileReader;
import java.io.IOException;
import java.text.DecimalFormat;
import java.util.ArrayList;
import java.util.List;
import java.util.Random;

import org.junit.Test;

/**
 * <p>Title: ResolveBJX </p>
 * <p>Description: TODO </p>
 * Date: 2016年11月15日 上午10:21:10
 * @author Administrator@hiynn.com
 * @version 1.0 </p> 
 * Significant Modify：
 * Date               Author           Content
 * ==========================================================
 * 2016年11月15日         Administrator         创建文件,实现基本功能
 * 
 * ==========================================================
 */
public class ResolveBJX {
	
	@Test
	public void test() {
		System.out.println("Hello World");
	}
	
	@Test
	public void resolveBJXToList() {
		File file = new File("E:\\project\\bjx.txt");
		List<String> firstNames = new ArrayList<>();
		try {
			BufferedReader reader = new BufferedReader(new FileReader(file));
			String line = reader.readLine();
			while (line != null) {
				if (!"".equals(line)) {
					String[] firstNameArrays = line.split(" ");
					for (String firstName : firstNameArrays) {
						firstNames.add("\"" + firstName + "\"");
					}
				}
				line = reader.readLine();
			}
		} catch (FileNotFoundException e) {
			System.out.println("File not found!!");
			e.printStackTrace();
		} catch (IOException e) {
			e.printStackTrace();
		}
		
		System.out.println(firstNames);
	}
	
	@Test
	public void resolveLastNameToList() {
		File file = new File("E:\\project\\lastname.txt");
		List<String> lastNames = new ArrayList<>();
		try {
			BufferedReader reader = new BufferedReader(new FileReader(file));
			String line = reader.readLine();
			while (line != null) {
				if (!"".equals(line)) {
					String[] lastNameArrays = line.split(",");
					for (String lastName : lastNameArrays) {
						lastNames.add("\"" + lastName + "\"");
					}
				}
				line = reader.readLine();
			}
		} catch (FileNotFoundException e) {
			System.out.println("File not found!!");
			e.printStackTrace();
		} catch (IOException e) {
			e.printStackTrace();
		}
		System.out.println(lastNames);
	}
	
	@Test
	public void resolveProvinceCityToList() {
		File file = new File("E:\\project\\province_city.txt");
		List<String> lastNames = new ArrayList<>();
		try {
			BufferedReader reader = new BufferedReader(new FileReader(file));
			String line = reader.readLine();
			while (line != null) {
				if (!"".equals(line)) {
					/*String[] lastNameArrays = line.split(",");
					for (String lastName : lastNameArrays) {
						lastNames.add("\"" + lastName + "\"");
					}*/
					lastNames.add("\"" + line + "\"");
				}
				line = reader.readLine();
			}
		} catch (FileNotFoundException e) {
			System.out.println("File not found!!");
			e.printStackTrace();
		} catch (IOException e) {
			e.printStackTrace();
		}
		System.out.println(lastNames);
		//"1301,石家庄市,13", "1302,唐山市,13", "1303,秦皇岛市,13", "1304,邯郸市,13", "1305,邢台市,13", "1306,保定市,13", "1307,张家口市,13", "1308,承德市,13", "1309,沧州市,13", "1311,衡水市,13", "1401,太原市,14", "1402,大同市,14", "1403,阳泉市,14", "1404,长治市,14", "1405,晋城市,14", "1406,朔州市,14", "1407,晋中市,14", "1408,运城市,14", "1409,忻州市,14", "1411,吕梁市,14", "1501,呼和浩特市,15", "1502,包头市,15", "1503,乌海市,15", "1504,赤峰市,15", "1505,通辽市,15", "1506,鄂尔多斯市,15", "1507,呼伦贝尔市,15", "1508,巴彦淖尔市,15", "1509,乌兰察布市,15", "1522,兴安盟,15", "1525,锡林郭勒盟,15", "1529,阿拉善盟,15", "2101,沈阳市,21", "2102,大连市,21", "2103,鞍山市,21", "2104,抚顺市,21", "2105,本溪市,21", "2106,丹东市,21", "2107,锦州市,21", "2108,营口市,21", "2109,阜新市,21", "2111,盘锦市,21", "2112,铁岭市,21", "2113,朝阳市,21", "2114,葫芦岛市,21", "2201,长春市,22", "2202,吉林市,22", "2203,四平市,22", "2204,辽源市,22", "2205,通化市,22", "2206,白山市,22", "2207,松原市,22", "2208,白城市,22", "2224,延边朝鲜族自治州,22", "2301,哈尔滨市,23", "2302,齐齐哈尔市,23", "2303,鸡西市,23", "2304,鹤岗市,23", "2305,双鸭山市,23", "2306,大庆市,23", "2307,伊春市,23", "2308,佳木斯市,23", "2309,七台河市,23", "2311,黑河市,23", "2312,绥化市,23", "2327,大兴安岭地区,23", "3201,南京市,32", "3202,无锡市,32", "3203,徐州市,32", "3204,常州市,32", "3205,苏州市,32", "3206,南通市,32", "3207,连云港市,32", "3208,淮安市,32", "3209,盐城市,32", "3211,镇江市,32", "3212,泰州市,32", "3213,宿迁市,32", "3301,杭州市,33", "3302,宁波市,33", "3303,温州市,33", "3304,嘉兴市,33", "3305,湖州市,33", "3306,绍兴市,33", "3307,金华市,33", "3308,衢州市,33", "3309,舟山市,33", "3311,丽水市,33", "3401,合肥市,34", "3402,芜湖市,34", "3403,蚌埠市,34", "3404,淮南市,34", "3405,马鞍山市,34", "3406,淮北市,34", "3407,铜陵市,34", "3408,安庆市,34", "3411,滁州市,34", "3412,阜阳市,34", "3413,宿州市,34", "3415,六安市,34", "3416,亳州市,34", "3417,池州市,34", "3418,宣城市,34", "3501,福州市,35", "3502,厦门市,35", "3503,莆田市,35", "3504,三明市,35", "3505,泉州市,35", "3506,漳州市,35", "3507,南平市,35", "3508,龙岩市,35", "3509,宁德市,35", "3601,南昌市,36", "3602,景德镇市,36", "3603,萍乡市,36", "3604,九江市,36", "3605,新余市,36", "3606,鹰潭市,36", "3607,赣州市,36", "3608,吉安市,36", "3609,宜春市,36", "3611,上饶市,36", "3701,济南市,37", "3702,青岛市,37", "3703,淄博市,37", "3704,枣庄市,37", "3705,东营市,37", "3706,烟台市,37", "3707,潍坊市,37", "3708,济宁市,37", "3709,泰安市,37", "3711,日照市,37", "3712,莱芜市,37", "3713,临沂市,37", "3714,德州市,37", "3715,聊城市,37", "3716,滨州市,37", "3717,菏泽市,37", "4101,郑州市,41", "4102,开封市,41", "4103,洛阳市,41", "4104,平顶山市,41", "4105,安阳市,41", "4106,鹤壁市,41", "4107,新乡市,41", "4108,焦作市,41", "4109,濮阳市,41", "4111,漯河市,41", "4112,三门峡市,41", "4113,南阳市,41", "4114,商丘市,41", "4115,信阳市,41", "4116,周口市,41", "4117,驻马店市,41", "4201,武汉市,42", "4202,黄石市,42", "4203,十堰市,42", "4205,宜昌市,42", "4206,襄阳市,42", "4207,鄂州市,42", "4208,荆门市,42", "4209,孝感市,42", "4211,黄冈市,42", "4212,咸宁市,42", "4213,随州市,42", "4228,恩施土家族苗族自治州,42", "4301,长沙市,43", "4302,株洲市,43", "4303,湘潭市,43", "4304,衡阳市,43", "4305,邵阳市,43", "4306,岳阳市,43", "4307,常德市,43", "4308,张家界市,43", "4309,益阳市,43", "4311,永州市,43", "4312,怀化市,43", "4313,娄底市,43", "4331,湘西土家族苗族自治州,43", "4401,广州市,44", "4402,韶关市,44", "4403,深圳市,44", "4404,珠海市,44", "4405,汕头市,44", "4406,佛山市,44", "4407,江门市,44", "4408,湛江市,44", "4409,茂名市,44", "4412,肇庆市,44", "4413,惠州市,44", "4414,梅州市,44", "4415,汕尾市,44", "4416,河源市,44", "4417,阳江市,44", "4418,清远市,44", "4419,东莞市,44", "4451,潮州市,44", "4452,揭阳市,44", "4453,云浮市,44", "4501,南宁市,45", "4502,柳州市,45", "4503,桂林市,45", "4504,梧州市,45", "4505,北海市,45", "4506,防城港市,45", "4507,钦州市,45", "4508,贵港市,45", "4509,玉林市,45", "4511,贺州市,45", "4512,河池市,45", "4513,来宾市,45", "4514,崇左市,45", "4601,海口市,46", "4602,三亚市,46", "5101,成都市,51", "5103,自贡市,51", "5104,攀枝花市,51", "5105,泸州市,51", "5106,德阳市,51", "5107,绵阳市,51", "5108,广元市,51", "5109,遂宁市,51", "5111,乐山市,51", "5113,南充市,51", "5114,眉山市,51", "5115,宜宾市,51", "5116,广安市,51", "5117,达州市,51", "5118,雅安市,51", "5119,巴中市,51", "5132,阿坝藏族羌族自治州,51", "5133,甘孜藏族自治州,51", "5134,凉山彝族自治州,51", "5201,贵阳市,52", "5202,六盘水市,52", "5203,遵义市,52", "5204,安顺市,52", "5205,毕节市,52", "5206,铜仁市,52", "5223,黔西南布依族苗族自治州,52", "5226,黔东南苗族侗族自治州,52", "5227,黔南布依族苗族自治州,52", "5301,昆明市,53", "5303,曲靖市,53", "5304,玉溪市,53", "5305,保山市,53", "5306,昭通市,53", "5307,丽江市,53", "5308,普洱市,53", "5309,临沧市,53", "5323,楚雄彝族自治州,53", "5325,红河哈尼族彝族自治州,53", "5326,文山壮族苗族自治州,53", "5328,西双版纳傣族自治州,53", "5329,大理白族自治州,53", "5331,德宏傣族景颇族自治州,53", "5333,怒江傈僳族自治州,53", "5334,迪庆藏族自治州,53", "5401,拉萨市,54", "5421,昌都地区,54", "5422,山南地区,54", "5423,日喀则地区,54", "5424,那曲地区,54", "5425,阿里地区,54", "5426,林芝地区,54", "6101,西安市,61", "6102,铜川市,61", "6103,宝鸡市,61", "6104,咸阳市,61", "6105,渭南市,61", "6106,延安市,61", "6107,汉中市,61", "6108,榆林市,61", "6109,安康市,61", "6201,兰州市,62", "6202,嘉峪关市,62", "6203,金昌市,62", "6204,白银市,62", "6205,天水市,62", "6206,武威市,62", "6207,张掖市,62", "6208,平凉市,62", "6209,酒泉市,62", "6211,定西市,62", "6212,陇南市,62", "6229,临夏回族自治州,62", "6301,西宁市,63", "6321,海东地区,63", "6322,海北藏族自治州,63", "6323,黄南藏族自治州,63", "6325,海南藏族自治州,63", "6326,果洛藏族自治州,63", "6327,玉树藏族自治州,63", "6328,海西蒙古族藏族自治州,63", "6401,银川市,64", "6402,石嘴山市,64", "6403,吴忠市,64", "6404,固原市,64", "6405,中卫市,64", "6501,乌鲁木齐市,65", "6502,克拉玛依市,65", "6521,吐鲁番地区,65", "6522,哈密地区,65", "6523,昌吉回族自治州,65", "6527,博尔塔拉蒙古自治州,65", "6528,巴音郭楞蒙古自治州,65", "6529,阿克苏地区,65", "6531,喀什地区,65", "6532,和田地区,65", "6542,塔城地区,65", "6543,阿勒泰地区,65 "
	}
	
	@Test
	public void randomTest() {
		Random random = new Random();
		DecimalFormat df = new DecimalFormat("0.00");
		for (int i = 0; i < 50; i++) {
			int ri = random.nextInt(36) + 15;
			double rd = random.nextDouble()*30+50;
			double rmd = Math.random()*30+50;
			System.out.println(ri + "    " + df.format(rd) + "    " + df.format(rmd));
		}
	}
	
	@Test
	public void randomBigInt() {
		Random random = new Random();
		
		long start1 = System.currentTimeMillis();
		for (int i = 0; i < 10000000; i++) {
			int j = random.nextInt(10000);
		}
		long end1 = System.currentTimeMillis();
		System.out.println(end1 - start1);
		
		long start2 = System.currentTimeMillis();
		for (int i = 0; i < 10000000; i++) {
			int j = random.nextInt(1000000000);
		}
		long end2 = System.currentTimeMillis();
		System.out.println(end2 - start2);
	}
	
	
	
	@Test
	public void createName() {
		String[] firstNames = {"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "楮", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞", "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮", "蓝", "闽", "席", "季", "麻", "强", "贾", "路", "娄", "危", "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "锺", "徐", "丘", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍", "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应", "宗", "丁", "宣", "贲", "邓", "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁", "荀", "羊", "於", "惠", "甄", "麹", "家", "封", "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫", "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宫", "宁", "仇", "栾", "暴", "甘", "斜", "厉", "戎", "祖", "武", "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶", "郜", "黎", "蓟", "薄", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙", "池", "乔", "阴", "郁", "胥", "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍", "郤", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农", "温", "别", "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向", "古", "易", "慎", "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄", "阙", "东", "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾", "辛", "阚", "那", "简", "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "后", "荆", "红", "游", "竺", "权", "逑", "盖", "益", "桓", "公", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫连", "皇甫", "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳", "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐", "锺离", "宇文", "长孙", "慕容", "鲜于", "闾丘", "司徒", "司空", "丌官", "司寇", "仉", "督", "子车", "颛孙", "端木", "巫马", "公西", "漆雕", "乐正", "壤驷", "公良", "拓拔", "夹谷", "宰父", "谷梁", "晋", "楚", "阎", "法", "汝", "鄢", "涂", "钦", "段干", "百里", "东郭", "南门", "呼延", "归", "海", "羊舌", "微生", "岳", "帅", "缑", "亢", "况", "后", "有", "琴", "梁丘", "左丘", "东门", "西门", "商", "牟", "佘", "佴", "伯", "赏", "南宫", "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟", "言", "福"};
		String[] lastNames = {"嘉", "琼", "桂", "娣", "叶", "璧", "璐", "娅", "琦", "晶", "妍", "茜", "秋", "珊", "莎", "锦", "黛", "青", "倩", "婷", "姣", "婉", "娴", "瑾", "颖", "露", "瑶", "怡", "婵", "雁", "蓓", "纨", "仪", "荷", "丹", "蓉", "眉", "君", "琴", "蕊", "薇", "菁", "梦", "岚", "苑", "婕", "馨", "瑗", "琰", "韵", "融", "园", "艺", "咏", "卿", "聪", "澜", "纯", "毓", "悦", "昭", "冰", "爽", "琬", "茗", "羽", "希", "宁", "欣", "飘", "育", "滢", "馥", "筠", "柔", "竹", "霭", "凝", "晓", "欢", "霄", "枫", "芸", "菲", "寒", "伊", "亚", "宜", "可", "姬", "舒", "影", "荔", "枝", "思", "丽", "秀", "娟", "英", "华", "慧", "巧", "美", "娜", "静", "淑", "惠", "珠", "翠", "雅", "芝", "玉", "萍", "红", "娥", "玲", "芬", "芳", "燕", "彩", "春", "菊", "勤", "珍", "贞", "莉", "兰", "凤", "洁", "梅", "琳", "素", "云", "莲", "真", "环", "雪", "荣", "爱", "妹", "霞", "香", "月", "莺", "媛", "艳", "瑞", "凡", "佳", "涛", "昌", "进", "林", "有", "坚", "和", "彪", "博", "诚", "先", "敬", "震", "振", "壮", "会", "群", "豪", "心", "邦", "承", "乐", "绍", "功", "松", "善", "厚", "庆", "磊", "民", "友", "裕", "河", "哲", "江", "超", "浩", "亮", "政", "谦", "亨", "奇", "固", "之", "轮", "翰", "朗", "伯", "宏", "言", "若", "鸣", "朋", "斌", "梁", "栋", "维", "启", "克", "伦", "翔", "旭", "鹏", "泽", "晨", "辰", "士", "以", "建", "家", "致", "树", "炎", "德", "行", "时", "泰", "盛", "雄", "琛", "钧", "冠", "策", "腾", "伟", "刚", "勇", "毅", "俊", "峰", "强", "军", "平", "保", "东", "文", "辉", "力", "明", "永", "健", "世", "广", "志", "义", "兴", "良", "海", "山", "仁", "波", "宁", "贵", "福", "生", "龙", "元", "全", "国", "胜", "学", "祥", "才", "发", "成", "康", "星", "光", "天", "达", "安", "岩", "中", "茂", "武", "新", "利", "清", "飞", "彬", "富", "顺", "信", "子", "杰", "楠", "榕", "风", "航", "弘", "净", "焦", "街", "诊", "理", "荔", "眨", "贴", "屠", "贷", "轸", "迢", "迪", "迦", "量", "钧", "钮", "间", "集", "杰", "劳", "单", "婷", "喋", "传", "塘", "塔", "暖", "楠", "殿", "渡", "汤", "帏", "幄", "惟", "掩", "椅", "涯", "液", "渊", "焰", "为", "异", "砚", "围茵", "越", "阮", "轶", "雁", "雅", "寓", "云", "雯", "媛", "喻", "贻", "婺", "焱", "琬", "琰", "畲", "劳", "博", "堡", "报", "富", "寒", "嵋", "帽", "幅", "帮", "弼", "复", "彭徨", "偏", "整", "理", "惠", "扉", "排", "斑", "酣", "普", "棉", "棒", "棚", "涵", "混", "淼", "淮", "淝", "牌", "画", "番", "发", "皓", "脉", "茗", "评", "贺", "费", "买", "贸", "迫", "邯", "闵", "防", "阪", "黄", "傅", "傍", "媒", "媚", "黑", "瓿", "匮", "块", "干", "感", "揆", "手", "楷", "港", "琨", "莞", "夸", "鼓", "该", "贾", "传", "仅", "涂", "塔", "塘", "廊", "谦", "提", "敬", "斟", "极", "楠", "殿汤", "渡", "绢", "经", "茎", "莒", "获", "莅", "庄", "莉", "蜀", "里", "装", "解", "詹", "鼎", "贾", "路", "迹", "退", "铃", "钜", "陀", "电", "雷", "靖", "顿", "暖", "桢", "路", "嫁", "农", "贮", "贷", "贴", "轸", "迪", "钠", "湍", "琳", "当", "略", "铃", "鼓", "励", "庸", "园", "圆", "奥", "爱", "意", "扬", "援", "握", "榆", "业", "杨", "椰涌", "渝", "渭", "游", "炜", "爷", "烟", "兽", "犹", "煜", "碗", "筠", "义", "肄", "莞", "莠", "虞", "蛾", "裕", "诣", "郁", "钰", "雍", "阿", "预", "饮", 
						"衙", "莹", "蓊", "晕", "渥", "琬", "琰", "畹", "筵", "裔", "淡", "催", "传", "勤", "势", "嗣", "塞", "嵩", "厦", "新", "喧", "楸", "楚", "岁湘", "测", "凑", "煦", "琴", "琪", "琦", "睡", "祺", "稔", "稠", "筮", "粲", "绣", "群", "圣", "莎", "裙", "诩", "诗", "试", "诠", "详", "资", "载", "送", "铅", "阻", "雌", "颂", "驰", "熙", "暄", "琼", "塞", "嵩", "想", "桢", "椿", "岁", "渚", "煮", "琛", "庄", "裟", "输", "轼", "幕", "汇", "惶", "挥", "描", "换", "楣", "枫", "湖", "浑", "渺", "涣", "煤烦", "琶", "琥", "盟", "睦", "碑", "禀", "聘", "腑", "荷", "莫", "号", "蜂", "补", "话", "酩", "附", "颁", "饭", "晕", "募", "焕", "廓", "愧", "沟", "管", "纲", "诰", "闺", "魁", "构", "歌", "恺", "斡", "荣构", "嘏", "通", "连", "这", "甄", "兢", "喜", "团", "图", "奖", "嫡", "对", "僚", "侥屡", "嶂", "崭", "彰", "廖", "熊", "溜", "监", "祯", "种", "端", "箕", "筝", "精", "绿", "紧", "绫", "纶", "置", "璋", "畅", "榔", "糍", "滇", "尔", "莱", "赵", "铬", "领", "瑙", "奁", "闻", "嫣", "愿", "温", "源", "溢", "尔", "瑜", "瑛", "瑗", "玮", "与舞", "苑", "诱", "语", "郢", "银", "摇", "榕", "荣", "温", "荥", "溶", "菸", "菀", "鞅", "瑛", "僖", "逑", "速", "逍", "肾", "寿", "塾", "尘", "嫩", "实", "像", "侨", "岖", "慈滋", "沧", "溶", "溪", "熊", "狮", "瑞", "瑟", "硕", "算", "粹", "绸", "综", "绰", "绮", "翠", "菁", "菜", "菖", "裳", "认", "誓", "诵", "说", "诚", "轻", "菘", "造", "速", "衔", "铨", "限", "需", "韶", "饲", "饰", "旗", "畅", "荣", "榕", "齐", "熏", "僦", "尝", "墅", "奖", "实", "寨", "慎", "准", "溯", "搴", "逢", "梦", "仆", "幕", "滑", "瑚", "珲", "碧", "福", "绵", "翡", "腑", "萍华", "菩", "蜜", "裴", "豪", "宾", "辅", "郝", "铭", "阀", "陌", "颇", "饮", "凤", "鸣", "榜", "槐", "滏", "宽", "广", "慷", "惯", "概", "瑰", "葛", "葵", "课", "逵", "郭", "稿", "靠溉", "锆", "俭", "著", "价", "厉", "剧", "剑", "刘", "妖", "履", "帜", "弹", "徵", "德虑", "摘", "敌", "整", "暂", "椿", "闾", "乐", "楼", "樟", "滴", "渐", "涨", "浆", "练", "缔", "蒂", "骀", "落", "董", "葶", "蝶", "调", "谆", "谈", "诋", "诤", "谅", "论", "质", "驼", "践", "轮", "逮", "进", "醇", "铝", "阵", "震", "霆", "驾", "驻", "稽", "稻", "稷", "节", "剪", "几", "鲁", "黎", "侬", "涤", "墩", "幢", "嶙", "锻", "褚", "亿", "仪", "影", "慰", "忧", "乐", "样", "欧", "毅", "演", "渔", "熬", "熠熨", "瑶", "缘", "纬", "腰", "万", "莹", "叶", "苇", "谊", "逸", "邮", "阅", "院", "鞍", "颐", "养", "欲", "颍", "粗", "缓", "卫", "葳", "骑", "妩", "鉴", "署", "啸", "增", "婵", "审", "层", "厂", "厨", "厮", "庆", "摧", "数", "枢漆", "熟", "热", "线", "肠", "兴", "萱", "冲", "褚", "谁", "请", "贤", "赏", "赐", "趣", "娴", "醉", "锐", "销", "爽", "霄", "驷", "确", "磁", "穷", "箭", "箱", "竖", "辍", "帜", "漩", "渐", "箴", "节", "绪", "翦", "葸", "诤", "谆", "质", "醇", "罚", "划", "哗", "坟", "墨", "币", "庙", "废", "慧", "慕", "慢", "暮", "樊标", "模", "流", "浒", "汉", "满", "漫", "漂", "玛", "缓", "编", "腹", "铺", "葆", "葡", "复", "卖", "赋", "辉", "辈", "部", "锋", "陛", "盘", "码", "篇", "范", "麾", "劈", "幡", "慧", "摩", "沪", "漠", "磐", "褒", "弼", "荭", "窥", "糕", "膏", "盖", "钢", "龟", "购", "器", "垦", "横", "橄", "篙", "馆尽", "坛",
						"导", "惮", "战", "撰", "整", "历", "瞳", "昙", "暨", "机", "橘", "洁", "潭", "灯", "瑾", "璋", "庐", "积", "筑", "蒸", "诸", "谛", "诺", "练", "猪", "赖", "蹄", "辑", "道", "达", "都", "录", "锦", "锭", "陆", "陶", "陵", "霓", "霖", "静", "颊", "头", "雕", "疆", "腿", "臻", "赚", "骆", "莅", "俦", "橙", "润", "澈", "笃", "缙", "萤", "国", "寇", "昆", "康", "苦", "袍", "规", "贯", "够", "勘", "崞", "岗", "梗", "珙", "偕", "假", "健", "停", "侦", "剪", "动", "翎", "念", "基", "坚", "堂", "堆", "婧", "寄", "专", "张", "得", "教", "救", "朗", "条", "梁", "梯", "械", "梨", "浙", "浪", "珠", "略", "皎", "眷", "窕", "竟", "第", "终", "累", "舵", "苓", "架", "诀", "近", "钓", "顶", "鸟", "将", "那", "��", "振", "挺", "捉", "捐", "甜", "祭", "趾", "囵", "堆", "凌", "崃", "带", "帐", "徕", "悌", "画", "梁", "梃", "桶", "町", "娄", "伟", "偶", "务", "唯", "问", "婉", "寅", "尉", "帷", "庸", "悟", "悠", "悦", "敖", "晚", "梧", "浴", "眼", "研", "移", "胃", "苑", "英", "迎", "野", "鱼", "欲", "浣", "翌", "圉", "乾", "做", "区", "卿", "参", "售", "启", "商", "唱", "娶", "妇", "宿", "崇", "崎", "崔", "常", "强", "从", "悄", "叙", "旋", "晨", "晟", "族", "消", "爽", "犀", "祥", "绅", "细", "紫", "组", "绍", "婧", "羞", "习", "邢", "舷", "船", "茄", "若", "处", "术", "袖", "设", "讼", "责", "赦", "雀", "雪", "顷", "彩", "常", "孰", "侦", "匙", "圊", "执", "将", "专", "就", "峥", "崧", "巢", "庶", "彩", "悉", "施", "曹", "浙", "笙", "钏", "阡", "凰", "毫", "培", "婚", "婆", "妇", "密", "彬", "彪", "患", "斌", "曼", "海", "浩", "烽", "班", "瓶", "毕", "盒", "符", "邦", "胡", "背", "胞", "胖", "舶", "范", "茅", "苗", "袍", "被", "觅", "访", "货", "返", "贩", "闭", "麦", "麻", "邦", "壶", "票", "冕", "副", "埠", "屏", "涵", "捕", "敏", "皓", "梅", "第", "珩", "艴"};
		int firstNameLength = firstNames.length;
		int lastNameLength = lastNames.length;
		Random random = new Random();
		for (int i = 0; i < 50; i++) {
			int firstRandom = random.nextInt(firstNameLength);
			int lastRandom = random.nextInt(lastNameLength);
			StringBuffer sb = new StringBuffer();
			sb.append(firstNames[firstRandom]).append(lastNames[lastRandom]);
			if (i % 9 == 0) {
				int secondRandom = random.nextInt(lastNameLength);
				sb.append(lastNames[secondRandom]);
			}
			System.out.println(sb.toString());
		}
	}
}
